# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, 
# Вам стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) 
# в каждой фразе стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов, 
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
# Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, 
# если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# *Пример:*

# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
#     **Вывод:** Парам пам-пам

def vowel_count(phrase):
    count = 0
    for let in phrase:
        if let == 'а':
            count += 1
    return count

def rhythmic_issues(song):
    vowels = vowel_count(song[0])
    for phrase in song:
        if vowel_count(phrase) != vowels:
            return False
    return True

song = input('Давай, Винни \n').split()
if (rhythmic_issues(song)):
    print('Парам пам-пам')
else:
    print('Пам парам')